# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

######################################################################
# The development, console and server stuff                          #
######################################################################

# ==== Some version control tools you might like ====
brew "topgrade"
brew "git"
brew "git-extras"
brew "gitui"
brew "tig"

# ==== Programming languages ====
cask "dotnet-sdk"
brew "llvm"
brew "gcc"

brew "bat"
brew "curl"
brew "jump"
brew "wget"

brew "--HEAD neovim" # Latest

brew "chezmoi" # yet another dotfiles manager
brew "rg" # ripgrep
brew "yq" # yq is a portable command-line YAML processor
brew "fzf" # fuzzy file finder
brew "zoxide" # jump for cd

brew "starship" # prompt for zsh

######################################################################
# Licensed software                                                  #
######################################################################

# ==== VPN ====
# cask "expressvpn"


######################################################################
# Shell: iTerm2, zsh, oh-my-zsh plugins and themes                   #
######################################################################

cask "iterm2"
brew "kitty" # terminal emulator
brew "zsh"
brew "zsh-autosuggestions"

tap "caskroom/fonts"
cask "font-menlo-for-powerline"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-fira-code"

######################################################################
# (Text-)Editors                                                     #
######################################################################

cask "visual-studio-code"

######################################################################
# Everyday tools / Cloud / Communication                             #
######################################################################

cask "alfred"
cask "path-finder"

cask "vlc"
cask "cheatsheet"

cask "macpass"

cask "calibre"

######################################################################
# Drivers                                                            #
######################################################################

#tap "caskroom/drivers"
#cask "canon-pixma-scanner-driver-ica"     # for my Canon MG5350 printer

######################################################################
# Browser                                                            #
######################################################################

cask "firefox"
cask "google-chrome"


