# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

######################################################################
# The development, console and server stuff                          #
######################################################################

# ==== Some version control tools you might like ====
brew "topgrade-rs"
brew "git"
brew "git-extras"
brew "diff-so-fancy"
brew "gitui"
brew "tig"

# ==== Programming languages and utilities ====
brew "llvm"
brew "gcc"

brew "curl"
brew "jump"
brew "wget"
brew "yq" # yq is a portable command-line YAML processor
brew "fzf" # fuzzy file finder

brew "bat" # cat done better
brew "exa" # ls done better
brew "rg" # ripgrep
brew "rip" # rm (Rm ImProved)
brew "zoxide" # jump for cd
brew "eva" # expression evaluator (Rust)
brew "felix" # tiny file-commander in terminal (Rust)
brew "miniserve" # miniserve is a cross-platform CLI tool that allows you to serve file(s) via HTTP

brew "qalculate-gtk"
brew "chezmoi" # yet another dotfiles manager
brew "starship" # prompt for zsh
brew "neovim" # Latest

######################################################################
# Licensed software                                                  #
######################################################################

# ==== VPN ====
# cask "expressvpn"

######################################################################
# Shell: iTerm2, zsh, oh-my-zsh plugins and themes                   #
######################################################################

cask "iterm2"
brew "zsh"
brew "zsh-autosuggestions"

tap "caskroom/fonts"
cask "font-menlo-for-powerline"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-fira-code"

######################################################################
# (Text-)Editors                                                     #
######################################################################

# cask "visual-studio-code"

######################################################################
# Everyday tools / Cloud / Communication                             #
######################################################################

cask "alfred"
cask "vlc"

cask "calibre"

######################################################################
# Drivers                                                            #
######################################################################

#tap "caskroom/drivers"
#cask "canon-pixma-scanner-driver-ica"     # for my Canon MG5350 printer

######################################################################
# Browser                                                            #
######################################################################

cask "google-chrome"


