# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

######################################################################
# The development, console and server stuff                          #
######################################################################
brew "bash" # latest bash 4.1+
brew "bash-completion@2" # bash completion v2

# ==== Some version control tools you might like ====
brew "topgrade"

brew "git"
brew "git-extras"
brew "diff-so-fancy"
brew "gitui"
brew "lazygit"
brew "git-delta" # delta, diff tool
brew "git bash-completion"

# ==== Programming languages and utilities ====
brew "llvm"
brew "gcc"

brew "curl"
brew "wget"
brew "jump"
brew "yq" # yq is a portable command-line YAML processor
brew "fzf" # fuzzy file finder
brew "felix" # tiny file-commander in terminal (Rust)

brew "bat" # cat done better
brew "lsd" # ls done better
brew "rg" # ripgrep
brew "rm-improved" # rm (Rm ImProved)
brew "zoxide" # jump for cd
brew "eva" # expression evaluator (Rust)
brew "miniserve" # miniserve is a cross-platform CLI tool that allows you to serve file(s) via HTTP

brew "starship" # prompt for zsh
brew "neovim" # Latest

######################################################################
# Licensed software                                                  #
######################################################################

######################################################################
# Shell: iTerm2, zsh, oh-my-zsh plugins and themes                   #
######################################################################

cask "iterm2"
brew "zsh"
brew "zsh-autosuggestions"

######################################################################
# (Text-)Editors                                                     #
######################################################################

brew "helix" # an editor written in Rust
brew "micro" # an editor written in Rust

######################################################################
# Everyday tools / Cloud / Communication                             #
######################################################################

cask "vlc"
cask "calibre"

######################################################################
# Drivers                                                            #
######################################################################


######################################################################
# Browser                                                            #
######################################################################

cask "google-chrome"


